In [53]:
import numpy as np
import pandas as pd

In [7]:
data = pd.read_csv('../data/beauty.csv', sep=';')

In [8]:
type(data)

pandas.core.frame.DataFrame

In [6]:
data.head()

  wage;exper;union;goodhlth;black;female;married;service;educ;looks
0                           5.73;30;0;1;0;1;1;1;14;4
1                           4.28;28;0;1;0;1;1;0;12;3
2                           7.96;35;0;1;0;1;0;0;10;4
3                          11.57;38;0;1;0;0;1;1;16;3
4                          11.42;27;0;1;0;0;1;0;16;3

In [9]:
data.head()

    wage  exper  union  goodhlth  black  female  married  service  educ  looks
0   5.73     30      0         1      0       1        1        1    14      4
1   4.28     28      0         1      0       1        1        0    12      3
2   7.96     35      0         1      0       1        0        0    10      4
3  11.57     38      0         1      0       0        1        1    16      3
4  11.42     27      0         1      0       0        1        0    16      3

In [10]:
data.shape

(1260, 10)

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1260 entries, 0 to 1259
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   wage      1260 non-null   float64
 1   exper     1260 non-null   int64
 2   union     1260 non-null   int64
 3   goodhlth  1260 non-null   int64
 4   black     1260 non-null   int64
 5   female    1260 non-null   int64
 6   married   1260 non-null   int64
 7   service   1260 non-null   int64
 8   educ      1260 non-null   int64
 9   looks     1260 non-null   int64
dtypes: float64(1), int64(9)
memory usage: 98.6 KB

In [12]:
data.describe()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
count,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000
mean,6.306690,18.206349,0.272222,0.933333,0.073810,0.346032,0.691270,0.273810,12.563492,3.185714
std,4.660639,11.963485,0.445280,0.249543,0.261564,0.475892,0.462153,0.446089,2.624489,0.684877
min,1.020000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,5.000000,1.000000
25%,3.707500,8.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,12.000000,3.000000
50%,5.300000,15.000000,0.000000,1.000000,0.000000,0.000000,1.000000,0.000000,12.000000,3.000000
75%,7.695000,27.000000,1.000000,1.000000,0.000000,1.000000,1.000000,1.000000,13.000000,4.000000
max,77.720000,48.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,17.000000,5.000000

In [13]:
data['exper']

0       30
1       28
2       35
3       38
4       27
        ..
1255    25
1256     4
1257    35
1258    15
1259    24
Name: exper, Length: 1260, dtype: int64

In [14]:
type(data['exper'])

pandas.core.series.Series

In [15]:
data['exper'].head()

0    30
1    28
2    35
3    38
4    27
Name: exper, dtype: int64

In [16]:
data.loc[0:5, ['wage', 'female']]

    wage  female
0   5.73       1
1   4.28       1
2   7.96       1
3  11.57       0
4  11.42       0
5   3.91       1

In [20]:
data.iloc[:,2:4].head()

   union  goodhlth
0      0         1
1      0         1
2      0         1
3      0         1
4      0         1

## Средний доход мужчин и женщин

In [30]:
data['female']==1

0        True
1        True
2        True
3       False
4       False
        ...
1255     True
1256     True
1257     True
1258     True
1259     True
Name: female, Length: 1260, dtype: bool

In [26]:
data[data['female']==1]['wage'].mean() ##средний доход женщин

4.299357798165137

In [27]:
data[data['female']==0]['wage'].mean() ##средний доход мужчин

7.3688228155339806

In [31]:
data[data['female']==1]['wage'].mean(), \
data[data['female']==0]['wage'].mean()

(4.299357798165137, 7.3688228155339806)

## Смотрим на статистику только по женатым мужчинам (выполняется два условия)

In [38]:
data[(data['female']==0) & (data['married']==1)].describe()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
count,658.000000,658.000000,658.000000,658.000000,658.000000,658.0,658.0,658.000000,658.000000,658.000000
mean,7.716778,22.136778,0.308511,0.937690,0.037994,0.0,1.0,0.194529,12.495441,3.164134
std,4.798763,11.714753,0.462230,0.241902,0.191327,0.0,0.0,0.396139,2.716007,0.655469
min,1.050000,1.000000,0.000000,0.000000,0.000000,0.0,1.0,0.000000,5.000000,1.000000
25%,4.810000,12.000000,0.000000,1.000000,0.000000,0.0,1.0,0.000000,12.000000,3.000000
50%,6.710000,20.500000,0.000000,1.000000,0.000000,0.0,1.0,0.000000,12.000000,3.000000
75%,8.890000,32.000000,1.000000,1.000000,0.000000,0.0,1.0,0.000000,13.000000,4.000000
max,41.670000,48.000000,1.000000,1.000000,1.000000,0.0,1.0,1.000000,17.000000,5.000000

In [43]:
data[(data['female'] == 0) & (data['married'] == 1)]['wage'].median(), \
data[(data['female'] == 0) & (data['married'] == 0)]['wage'].median()

(6.710000000000001, 5.0649999999999995)

In [44]:
data.groupby('looks')

In [45]:
for i in data.groupby('looks'):
    print(type(i))

<class 'tuple'>
<class 'tuple'>
<class 'tuple'>
<class 'tuple'>
<class 'tuple'>

In [46]:
for look, sub_df in data.groupby('looks'):
    print(look)

1
2
3
4
5

In [47]:
for look, sub_df in data.groupby('looks'):
    print(look)
    
    print(sub_df.head())

1
      wage  exper  union  goodhlth  black  female  married  service  educ  \
28    8.35     41      0         0      0       0        1        1    16
200   3.75     36      0         1      0       0        0        0    12
248  10.99     40      0         1      0       0        1        0    12
327   1.65     24      0         1      0       1        0        1    13
751   7.93     39      1         1      0       0        1        0    12

     looks
28       1
200      1
248      1
327      1
751      1
2
    wage  exper  union  goodhlth  black  female  married  service  educ  looks
12  5.14     19      0         1      0       0        1        1    17      2
33  8.17     18      0         1      0       0        1        0    16      2
35  9.62     37      0         1      0       0        1        0    13      2
37  7.69     10      1         1      0       0        1        0    13      2
57  6.56     17      0         1      0       0        1        0    13      2
3
    wage  exper  union  goodhlth  black  female  married  service  educ  looks
1   4.28     28      0         1      0       1        1        0    12      3
3  11.57     38      0         1      0       0        1        1    16      3
4  11.42     27      0         1      0       0        1        0    16      3
5   3.91     20      0         0      0       1        1        0    12      3
6   8.76     12      0         1      0       0        1        0    16      3
4
    wage  exper  union  goodhlth  black  female  married  service  educ  looks
0   5.73     30      0         1      0       1        1        1    14      4
2   7.96     35      0         1      0       1        0        0    10      4
7   7.69      5      1         1      0       0        0        0    16      4
10  3.45      3      0         1      0       1        0        0    12      4
11  4.03      6      0         1      0       0        1        0    16      4
5
      wage  exper  union  goodhlth  black  female  married  service  educ  \
26   14.84     29      0         1      0       0        0        1    13
27   19.08     17      0         1      0       0        0        0    17
76   23.32     15      0         1      0       0        1        1    17
112   6.11      7      0         1      0       1        1        0    12
316   3.92     12      0         1      0       0        1        1    12

     looks
26       5
27       5
76       5
112      5
316      5

## Подсчет медианного дохода по рейингу красоты

In [48]:
for look, sub_df in data.groupby('looks'):
    print(look)
    
    print(sub_df['wage'].median())

1
3.46
2
4.595000000000001
3
5.635
4
5.24
5
4.81

## Средняя доля женщин в рейинге красоты

In [49]:
for look, sub_df in data.groupby('looks'):
    print(look)
    
    print(sub_df['female'].mean())

1
0.38461538461538464
2
0.38028169014084506
3
0.32271468144044324
4
0.37362637362637363
5
0.42105263157894735

In [50]:
data['female'].mean()

0.346031746031746

## Подсчет среднего (медиана) дохода по всем уникальным значениям рейтинга красоты

In [54]:
data.groupby('looks')[['wage', 'exper']].agg(np.median)

        wage  exper
looks
1      3.460   32.0
2      4.595   18.0
3      5.635   18.0
4      5.240   12.5
5      4.810    8.0

In [56]:
pd.crosstab(data['female'], data['married'])

married    0    1
female
0        166  658
1        223  213

In [57]:
pd.crosstab(data['female'], data['looks'])

looks   1   2    3    4   5
female
0       8  88  489  228  11
1       5  54  233  136   8

## Создаем новый столбец, в котором будет бинарный признак того бедный человек или богатый. Отсекаем по 75% квартилю

In [58]:
data['wage'].describe()

count    1260.000000
mean        6.306690
std         4.660639
min         1.020000
25%         3.707500
50%         5.300000
75%         7.695000
max        77.720000
Name: wage, dtype: float64

In [59]:
data['wage'].quantile(0.75)

7.695

In [60]:
data['wage'] > data['wage'].quantile(.75)

0       False
1       False
2        True
3        True
4        True
        ...
1255    False
1256    False
1257    False
1258    False
1259    False
Name: wage, Length: 1260, dtype: bool

In [61]:
(data['wage'] > data['wage'].quantile(.75)).astype('int64')

0       0
1       0
2       1
3       1
4       1
       ..
1255    0
1256    0
1257    0
1258    0
1259    0
Name: wage, Length: 1260, dtype: int64

In [62]:
data['is_rich'] = (data['wage'] > data['wage'].quantile(.75)).astype('int64')

In [63]:
data.head()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks,is_rich
0,5.73,30,0,1,0,1,1,1,14,4,0
1,4.28,28,0,1,0,1,1,0,12,3,0
2,7.96,35,0,1,0,1,0,0,10,4,1
3,11.57,38,0,1,0,0,1,1,16,3,1
4,11.42,27,0,1,0,0,1,0,16,3,1

## Строим новый линейнозависимый признак

In [64]:
data['rubbish'] = .56 * data['wage'] + .32 * data['exper']

In [65]:
data.head()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks,is_rich,rubbish
0,5.73,30,0,1,0,1,1,1,14,4,0,12.8088
1,4.28,28,0,1,0,1,1,0,12,3,0,11.3568
2,7.96,35,0,1,0,1,0,0,10,4,1,15.6576
3,11.57,38,0,1,0,0,1,1,16,3,1,18.6392
4,11.42,27,0,1,0,0,1,0,16,3,1,15.0352

## Добавляем строковый признак male/female на основе признака female

In [66]:
def string_gender(female):
    return 'female' if female else 'male'

In [67]:
data['female'].apply(string_gender)

0       female
1       female
2       female
3         male
4         male
         ...
1255    female
1256    female
1257    female
1258    female
1259    female
Name: female, Length: 1260, dtype: object

## То же самое с помощью lambda функции и функции apply

In [68]:
data['female'].apply(lambda female: 'female' if female else 'male')

0       female
1       female
2       female
3         male
4         male
         ...
1255    female
1256    female
1257    female
1258    female
1259    female
Name: female, Length: 1260, dtype: object

In [69]:
data.head()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks,is_rich,rubbish
0,5.73,30,0,1,0,1,1,1,14,4,0,12.8088
1,4.28,28,0,1,0,1,1,0,12,3,0,11.3568
2,7.96,35,0,1,0,1,0,0,10,4,1,15.6576
3,11.57,38,0,1,0,0,1,1,16,3,1,18.6392
4,11.42,27,0,1,0,0,1,0,16,3,1,15.0352

## Добавляем новый признак, используя функцию map и словарь dictionary

In [70]:
d = {1: 'union', 0: 'non-union'}

In [71]:
data['union'].map(d).head()

0    non-union
1    non-union
2    non-union
3    non-union
4    non-union
Name: union, dtype: object